"Every 10 minutes" = "Ogni 10 minuti";
"Manually" = "Manualmente";
"Rescan" = "Aggiorna";
"Show Info" = "Mostra Informazioni";
"Delete selected source" = "Cancella l'origine selezionata";
"Every day" = "Ogni giorno";
"Add source..." = "Aggiungi origine ...";
"Every half hour" = "Ogni mezz'ora";
"Rescan source" = "Aggiorna origine";
"Sources" = "Origini";
"Every hour" = "Ogni ora";
"Rescan frequency" = "Frequenza di aggiornamento";
